Revit 2027 API
RevitLinkInstance.GetLinkDocument Method
 The document associated with the Revit link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document GetLinkDocument()
Public Function GetLinkDocument As Document
public:
Document^ GetLinkDocument()
member GetLinkDocument : unit -> Document
Return Value
Document
Remarks
 Operations that require a transaction or modify the document's status in memory (such as Save and Close) cannot be performed on this document.
See Also
Reference
RevitLinkInstance Class
Autodesk.Revit.DB Namespace